<template><div><h1 id="关于职级晋升" tabindex="-1"><a class="header-anchor" href="#关于职级晋升" aria-hidden="true">#</a> 关于职级晋升</h1>
<p>早上 6 点 45 分收到企业微信，通知职级晋升的事情。</p>
<p>时间拉回到去年，那时候一次周会，会上第一次提出要定职级。当时觉得，有职级的概念，我终于知道该往哪个方向努力，知道自己还有什么差距需要努力。另一方面，职级晋升带来的工资和年终奖的提升也是非常诱人与实在的。从任何角度来看，这都是一个正向反馈的事情。</p>
<p>时间来到去年年底，Air 项目做的怨声载道，结果团队绩效给了 0.9。虽然领导给面子，当然也可能是觉得我工资低，个人绩效给了我 1.2，但是大家明显有了付出和回报不成正比的怨气。当时还侥幸，1.2 的个人绩效，至少团队绩效少掉的年终奖弥补了回来，而且次年的晋升多半会有些许优势，却没成想今年会过得如此崎岖。</p>
<p>时间来到今年上半年，财年结束也并未有任何晋升的消息，只有普调取消的消息。再加上公司平添了些许野生动物园之趣，上半年是过的风波不断、前途暗淡。本想着组件库立项能成为日后晋升的谈资，却没成想领导并不看好这一无用的项目，这便连浪费时间的机会都不给我了。</p>
<p>这段时间种种操劳，各种加班，在各位产品设计间来回切换，大部分时间最终化为了无用功，仿佛去年的事情又要重演。大家又是怨声载道，再加上今年还有人帮助公司回馈社会，大家在位置上如坐针毡，同床异梦的事情也是常有发生。谁能想到短短一年时间，公司能在人文与专业两块双双坠落。</p>
<p>对于我而言，B5 或 B6 或 B7 毫无意义，拿到手的钱才是真的，尤其在我得知比我低一级的同事工资已经倒挂了我，我更是揣测升职带来的经济收益可能只是小幅的工资提升和大量的期权提升。毕竟
工资的支出是实打实的，而期权只是期权。本在同职级中已是做得多赚的少，即使提升了职级，依然是做得多赚的少，那也许虚头巴脑的职级，于我而言是更无意义了。</p>
<p>最后还是希望大家都能有光明的未来，同职级里站在最高的位置，已经在高位的能顺利晋升。</p>
</div></template>


